<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//DE">
<html>
<head>
  <title>Cumulus Einf&uuml;hrung</title>
</head>
<body>

    <table width="100%">
    <tr>
    <td align="left"><a href="cumulus.html">zur&uuml;ck</a></td>
    <td align="center"><a href="cumulus.html">Anfang</a></td>
    <td align="right"><a href="cumulus-maps.html">weiter</a></td>
    </tr>
    </table>

<h3 align="center">Einf&uuml;hrung</h3>

    Um Cumulus sinnvoll nutzen zu k&ouml;nnen, sind ein
    GPS-Empf&auml;nger und die entsprechenden Karten Dateien
    erforderlich.

<dl>
  <dt><b>PDA</b></dt>

  <dd>
    W&auml;hrend das Programm auf dem PDA l&auml;uft sind die
    automatische Abschaltung durch die Stromsparfunktion und der
    Bildschirmschoner deaktiviert. Deshalb ist es unbedingt
    erforderlich, den PDA bei l&auml;ngeren Betriebszeiten mit einer
    externen Stromversorgung auszustatten.
  </dd>

  <dt><b>GPS</b></dt>
  
  <dd>
    Sie k&ouml;nnen einen externen GPS Empf&auml;nger benutzen der
    sich mit dem PDA &uuml;ber ein Kabel oder &uuml;ber Blue Tooth
    verbinden l&auml;&szlig;t und Daten &uuml;ber eine serielle
    Schnittstelle im NMEA-Format &uuml;bertr&auml;gt.  Weiterhin kann
    auch eine GPS Compact Flash Karte (CF), die &uuml;ber eine
    serielle Schnittstelle verf&uuml;gt, verwendet werden.  Cumulus
    kann auch ohne GPS betrieben werden, ist dann jedoch bei weitem
    nicht so n&uuml;tzlich.
    <p>
    Sobald Sie Ihr GPS mit dem PDA verbunden haben, w&auml;hlen Sie
    die entsprechende Ger&auml;teschnittstelle und die
    dazugeh&ouml;rige &Uuml;bertragungsrate im
    <a href="cumulus-settings.html">Konfigurationdialog</a> aus.

    Lesen Sie im Handbuch Ihres GPS Empf&auml;ngers nach um die
    erforderlichen Daten zu erfahren.  Die meisten seriellen
    Verbindungen arbeiten mit der Ger&auml;teschnittstelle
    <i>/dev/ttyS0</i>. F&uuml;r Compact Flash Empf&auml;nger ist
    <i>/dev/ttyS3</i> &uuml;blich. Die &Uuml;bertragungsrate
    betr&auml;gt normalerweise 4800 bps.
    <p>
    Nachdem alles verbunden und eingestellt ist, sollten Sie die Taste
    <b>G</b> dr&uuml;cken, um in den GPS Status Monitor zu
    wechseln. Bei korrektem Empfang sehen Sie hier die
    Sattelitenpositionen und die NMEA-Datens&auml;tze im Anzeigefeld.
  </dd>

  <dt><b>Karten</b></dt>

  <dd>
    Cumulus benutzt die gleichen Karten wie <i>KFLog</i>, das KDE
    Flugplanungs- und Auswertungsprogramm, und <i>KFLog/Embedded</i>.
    Mit dem letzteren nutzt es gemeinsam die Karten. Laden Sie sich
    die ben&ouml;tigten Karten aus dem Internet herunter und
    installieren Sie sie auf Ihrem PDA oder auf einer CompactFlash
    Card, Multimedia Card oder SecureDigital Card. Siehe auch unter
    <a href="cumulus-maps.html">Karten</a> f&uuml;r weitere Informationen
    zum Laden und Installieren von Karten.
  </dd>

  <dt><b>Wegpunkte</b></dt>

  <dd>
    Cumulus benutzt Wegpunkte um die Navigation zu erleichtern.
    Sie k&ouml;nnen Ihre Wegpunktdateien in Cumulus bearbeiten oder
    auch mit Hilfe von <i>KFLog</i> auf Ihrem
    Arbeitsplatzrechner vorbereiten und sie dann auf ihren PDA
    &uuml;bertragen. Siehe auch unter
    <a href="cumulus-waypoints.html">Wegpunkte</a> f&uuml;r weitere
    Hinweise.
  </dd>
  
  <dt><b>Aufgaben</b></dt>

  <dd>
    Cumulus unterst&uuml;tzt auch die Definition von Flugaufgaben. Sie
    k&ouml;nnen diese entweder auf dem PDA editieren oder sie auf dem
    Arbeitsplatzrechner mit Hilfe von <i>KFLog</i> erstellen und sie
    anschlie&szlig;end auf den PDA runter laden. Siehe auch unter
    <a href="cumulus-preflight-settings-task.html">Aufgabe</a>
    f&uuml;r weitere Hinweise zu Aufgaben.   
  </dd>

</dl>

    <table width="100%">
    <tr>
    <td align="left"><a href="cumulus.html">zur&uuml;ck</a></td>
    <td align="center"><a href="cumulus.html">Anfang</a></td>
    <td align="right"><a href="cumulus-maps.html">weiter</a></td>
    </tr>
    </table>
</body>
</html>
