<!-- $Id$ -->

<html>
<head>
  <title>Cumulus Wegpunkte</title>
  <link rel="stylesheet" type="text/css" href="text.css">
</head>
<body>

    <table width="100%">
    <tr>
    <td align="left"><a href="cumulus-manual.html">zur&uuml;ck</a></td>
    <td align="center"><a href="cumulus.html">Anfang</a></td>
    <td align="right"><a href="cumulus-tasks.html">weiter</a></td>
    </tr>
    </table>

<h3 align="center">Wegpunkte</h3>
    <p>
    Wegpunkte werden von Cumulus benutzt um die Navigation zu
    erleichtern. Sie werden auch als Wendepunkte in Aufgaben
    verwendet. Die Wegpunkte k&ouml;nnen auch mit <i>KFLog</i> auf den
    Linux Desktop Rechner bearbeitet werden. Unter KFLog ist es
    einfacher die Liste zu verwalten oder Wegpunkte aus
    Flugplatzdateien oder anderen Dateien zu importieren.
    Cumulus &uuml;nterst&uuml;tzt im Moment nur eine Wegpunktdatei.
    Diese ist unter <i>$HOME/Applications/cumulus</i> zu finden.
    Als Dateiname muss <i>cumulus.kwp</i> benutzt werden.
    </p>

    <p>
    Um einen Wegpunkt auszuw&auml;hlen, dr&uuml;cken Sie
    <i><b>W</b></i> um die Wegpunktliste zu &ouml;ffnen. Navigieren
    Sie zu einen Wegpunkt mit Hilfe der Anfangsbuchstaben oder mit den
    Pfeiltasten. Dr&uuml;cken Sie dann die <i><b>Leer-</b></i> oder
    <i><b>Auswahltaste</b></i> um den selektierten Wegpunkt
    auszuw&auml;hlen.
    <p>
    Benutzen Sie den Knopf <b><i>Information</i></b> am Fu&szlig; der
    Liste, um mehr Informationen &uuml;ber den hervorgehobenen
    Wegpunkt zu erhalten.  Der Informationsbildschirm wird automatisch
    nach 7 Sekunden geschlossen.  Dr&uuml;cken Sie <b><i>I</i></b>
    um den Bildschirm f&uuml; 7 weitere Sekunden offen zu halten, und
    dr&uuml;cken Sie <b><i>K</i></b> um den Bildschirm ge&ouml;ffnet zu halten.
    Dr&uuml;cken Sie die Leer- oder Auswahltastetaste um ihn zu
    schlie&szlig;en.
    </p>

    <p>
    Der ausgew&auml;hlte Wegpunkt wird auf der Karte durch umgekehrte
    Einf&auml;rbung des Namens gekennzeichnet.  Um sicherzustellen,
    dass der ausgew&auml;hlte Wegpunkt auf der Karte sichbar ist,
    k&ouml;nnen Sie die Taste <b><i>V</i></b> benutzen.
    </p>

    <p>
    Um Wegpunkte hinzuzuf&uuml;gen, zu ver&auml;ndern oder zu l&ouml;schen,
    benutzen Sie bitte die Ikonen am Kopf der Wegpunktliste:

    <ul>
      <li> Neu = weisses Blatt
      <li> Bearbeiten = Bleistift
      <li> L&ouml;schen = Papierkorb
     </ul>

    <p><b>Tun Sie das aber nicht w&auml;hrend des Fluges!</b><p>

    Wenn Sie <i>Neu</i> oder <i>Bearbeiten</i> ausw&auml;hlen, wird
    ein Dialog mit Eingabefeldern f&uuml;r die Eigenschaften des
    Wegpunktes ge&ouml;ffnet.  Die Eigenschaft <i>Wichtigkeit</i>
    bedarf einer Erkl&auml;rung.  Um zu verhindern, dass die Karte bei
    niedrigen Aufl&ouml;sungen mit Wegpunkten &uuml;berflutet wird,
    werden nicht alle Wegpunkte in allen Aufl&ouml;sungen gezeigt.
    Sie k&ouml;nnen dies kontrollieren, indem Sie die Wichtigkeit des
    Wegpunktes geeignet w&auml;hlen.  Wenn sie <i>hoch</i>
    w&auml;hlen, wird der Wegpunkt immer gezeichnet.  Dies ist
    sinnvoll f&uuml;r den Heimatplatz und andere wichtige Pl&auml;tze.
    Wenn Sie <i>normal</i> w&auml;hlen, wird der Wegpunkt in mittleren
    und hohen Aufl&ouml;sungen gezeichnet, nicht jedoch in niedrigen
    Aufl&ouml;sungen.  Wegpunkte mit niedriger Wichtigkeit werden nur
    in hohen Aufl&ouml;sungen gezeichnet.  Der ausgew&auml;hlte
    Wegpunkt ist immer sichtbar.
    </p>

    <p>
    Sie k&ouml;nnen jederzeit <i><b>R</b></i> dr&uuml;cken um die
    augenblickliche Position und H&ouml;he als Wegpunkt festzuhalten.
    Ein neuer Wegpunkt mit dem Namen <i>WPX HH:MM</i> wird dann
    generiert.  Er enth&auml;lt die augenblicklichen Koordinaten und
    die H&ouml;he, wobei <i>HH:MM</i> von der aktuellen UTC Zeit
    abgeleitet wird. Der neue Wegpunkt erscheint sogleich auf der
    Karte und kann in der Wegpunktliste wie jeder andere Wegpunkt
    bearbeitet werden.
    </p>

    <p>
    Wegpunkte werden auch f&uuml;r die Zielanflugberechnung benutzt.
    Wenn Sie diese Eigenschaft von Cumulus benutzen wollen, stellen
    Sie sicher, dass die Position und die H&ouml;he des Wegpunktes
    &uuml;ber MSL korrekt sind!
    </p>

    <table width="100%">
    <tr>
    <td align="left"><a href="cumulus-manual.html">zur&uuml;ck</a></td>
    <td align="center"><a href="cumulus.html">Anfang</a></td>
    <td align="right"><a href="cumulus-tasks.html">weiter</a></td>
    </tr>
    </table>
</body>
</html>
