<!-- $Id$ -->

<html>
<head>
  <title>Cumulus Bildschirm</title>
  <link rel="stylesheet" type="text/css" href="text.css">
</head>
<body>

    <table width="100%">
    <tr>
    <td align="left"><a href="cumulus-preflight-settings-common.html">zur&uuml;ck</a></td>
    <td align="center"><a href="cumulus.html">Anfang</a></td>
    <td align="right"><a href="cumulus-usage.html">weiter</a></td>
    </tr>
    </table>

    <h3 align="center">Bildschirm</h3>

    Die Hauptansicht von Cumulus besteht aus drei
    Informationszeilen, der Kartenansicht und einer
    Statuszeile. Dieser Bildschirm wird auch als Kartenansicht
    bezeichnet.

    <h4>Fluginformation</h4>

     Die einzelnen Anzeigen in den Feldern der drei oberen Zeilen
     bedeuten:

        <ul>
          <li><b>Trk</b> - Kurs (wird auch angezeigt durch die Richtung des Segelflugzeug Symbols)</li>
          <li><b>Brg</b> - Kurs zum eingestellten Ziel, tippen auf Zahl zeigt f&uuml;r f&uuml;nf
                           Sekunden rot hinterlegt den Gegenkurs an.</li>
          <li><b>Pfeil</b> - zeigt zum Ziel relativ zum aktuellen Kurs. Wenn man auf das Pfeilsymbol tippt
                             wird die aktuelle Position als Wegpunkt gespeichert.</li>
          <li><b>Dis/Eta</b> - Entfernung bzw. Flugzeit (hh:mm) bis zum Ziel.
                               Tippen auf Beschriftung, wechselt die Anzeige.</li>
          <li><b>Gs</b> - Geschwindigkeit &uuml;ber Grund</li>
          <li><b>Msl/Gnd</b> - aktuelle Flugh&ouml;he &uuml;berm Meer/Grund.
                               Tippen auf Beschriftung, wechselt die Anzeige.</li>
          <li><b>Arv</b> - H&ouml;he &uuml;ber (positiv) oder unter (negativ)
                           dem <a href="#glidepath">Gleitpfad</a> zum Zielpunkt</li>
          <li><b>To</b> - Name des Zielpunktes und in Klammern H&ouml;he &uuml;ber MSL.
                          Tippen Sie auf Beschriftung, um ein anders Ziel zu selektieren.
          <li><b>Var</b> - Variometer Anzeige, wird von der GPS-H&ouml;he abgeleitet.
                           Tippen auf Beschriftung &ouml;ffnet einen Dialog, in dem die
                           Integrationszeit ge&auml;ndert werden kann.
          <li><b>Wd</b> - Wind Geschwindigkeit und Richtung. Wind und Vario Anzeige kann
          		  durch tippen auf Wd Beschriftung auf Gleitzahl Anzeige umgeschaltet
          		  werden.</li>
          <li><b>LD</b> - Erforderliche und augenblickliche Gleitzahl zum ausgew&auml;hlten
          		  Ziel. Kann mit Wind und Vario Anzeige zusammen umgeschaltet werden.
                          Tippen auf LD Beschriftung schaltet zu Vario und Wind um.
                          Siehe auch <a href="#ld">Gleitzahl Anzeige Beschreibung</a> f&uuml;r mehr
                          Informationen.</li>
          <li><b>Mc</b> - McCready Wert, wird f&uuml;r Gleitpfad und Fahrtberechnung benutzt</li>
          <li><b>S2f</b> - optimale Fahrt f&uuml;r aktuellen McCready Wert,
                           Variometer und Wind Information</li>
        </ul>

     Alle Informationen werden in den Einheiten dargestellt, die im <a
     href="cumulus-settings.html">Einstellungs-Dialog</a>
     ausgew&auml;hlt wurden.

    <h4>Karte</h4>

     Die Karte zeigt eine grafische Darstellung der gegenw&auml;rtigen
     Position (die genaue Position ist der Schnittpunkt aus Rumpf und
     Tragfl&auml;chen des Segelflugzeug Symbols) und des Kurses
     (angezeigt durch die Ausrichtung des Segelflugzeuges) an. Wenn es
     keine Positionsbestimmung durch das GPS gibt, zeigt Cumulus ein
     Kreuz anstelle des Segelflugzeuges an. Siehe auch unter Punkt <a
     href="cumulus-manual.html"> manuelle Betriebsart</a> f&uuml;r
     weitere Details. Der aktuelle Ma&szlig;stab wird in der unteren
     rechten Ecke der Karte angezeigt.
     <p>
     Die Gel&auml;ndeh&ouml;he wird durch verschiedene Farben
     dargestellt. Die Detailgenauigkeit &auml;ndert sich mit dem Zoom
     Faktor. Bei einer h&ouml;heren Aufl&ouml;sung werden mehr
     Gel&auml;ndemerkmale dargestellt. Das Zeichnen der
     Gel&auml;ndemerkmale kann im <a
     href="cumulus-settings.html">Konfigurationsdialog</a>
     abgeschaltet werden.
     <p>
     Abh&auml;ngig von den installierten Karten zeigt Cumulus
     Flugpl&auml;tze in Form von ICAO-Symbolen, St&auml;dte (gelb),
     Autobahnen (rot/wei&szlig;), Stra&szlig;en (rot) und
     Eisenbahnlinien (dunkelgrau), und Wasser (blau). Auch hier werden
     in einigen Zoom Faktoren nicht alle Details angezeigt.  Cumulus
     zeigt auch Luftraumstrukturen an. Unterschiedliche Luftr&auml;ume
     werden in verschiedenen Farben dargestellt.
     <p>
     Durch kurzes Antippen eines Flugplatzsymbols oder eines Luftraums
     auf dem Bildschirm erhalten Sie allgemeine Informationen wie
     z.B. die vertikale Ausdehnung des Luftraums oder die Frequenz des
     Flugplatzes in einem extra Fenster dargestellt. Dieses Fenster
     verschindet automatisch nach einiger Zeit wieder. Die
     Anzeigedauer selbst kann &uuml;ber das Konfigurationsmen&uuml;
     <i>Einstellungen</i> Tabulator <a
     href="cumulus-settings-information.html"><i>Informationen</i></a>
     eingestellt werden.
     <p>
     Durch l&auml;ngeres Antippen erhalten Sie detailierte Angaben
     &uuml;ber Flugpl&auml;tze.  &Uuml;brigens k&ouml;nnen Sie
     Flugpl&auml;tze zu Ihrer Wegpunktliste hinzuf&uuml;gen, wenn sie
     nicht schon enthalten sind. Hinzugef&uuml;gte Wegpunkte erhalten
     standardm&auml;&szlig;ig die <i>normale</i>
     Priorit&auml;t. Weiterhin k&ouml;nnen Sie den gezeigten Flugplatz
     auch als neuen Heimatplatz setzen, wenn er es nicht schon
     ist. <br> Die beiden letztgenannten Funktionen werden aber nur am
     Boden und nicht w&auml;hrend des Fluges angeboten.
     </p>

     <h4>Statuszeile</h4>

     Die Statuszeile enth&auml;lt drei Informationen. Das erste Feld
     zeigt den Zustand an in dem Cumulus gerade arbeitet. Wenn keine
     Verbindung mit einem GPS-Empf&auml;nger vorhanden ist, wird
     <i>Man</i> angezeigt. Ansonsten steht hier <i>GPS</i> und die
     Anzahl der empfangenen Satelliten.
     <p>
     Das zweite Feld ist eine Kombination aus Logging- und Flugzustand.
     Ganz links ist ein <i>L</i> zu sehen, wenn das IGC-Logging
     aktiviert ist. Das Symbol wird hervorgehoben, sobald
     Aufzeichnungen gemacht werden. Das Flugzustangssymbol ist
     entweder allein in der Mitte des Statusfeldes oder rechts neben
     dem Loggingsymbol zu sehen, in Abh&auml;ngigkeit davon, ob
     Logging aktiviert ist oder nicht.
     <p>
     Die folgenden Symbole werden f&uuml;r die Flugzustandsanzeige
     benutzt:

       <ul>
        <li><b>?</b> - Unbekannt
        <li><b>C</b> - Reiseflug
        <li><b>L</b> - Kreisen links
        <li><b>R</b> - Kreisen rechts
        <li><b>S</b> - Stillstand
        <li><b>W</b> - Leewelle
      </ul>

     <p>
     Das rechte Feld der Statuszeile zeigt die augenblickliche
     Position als L&auml;ngen- und Breitengrad an.
     <p>
     Wenn Sie den Bildschirm f&uuml;r die Darstellung der Karte
     maximieren m&ouml;chten, k&ouml;nnen Sie die Statuszeile
     unterdr&uuml;cken. Gehen Sie dazu in das Men&uuml;
     <i>Ansicht/Statuszeile</i> und deaktivieren Sie den
     entsprechenden Eintrag.
     </p>

     <h4>Gleitpfad</h4><a name="glidepath"></a>

     Der angezeigte Gleitpfad gibt Auskunft dar&uuml;ber, ob der
     ausgew&auml;hlte Zielpunkt erreicht werden kann. Die Berechnung
     erfolgt auf Basis der gegenw&auml;rtigen Flugh&ouml;he, des
     Windes, der Gel&auml;nde&ouml;he des Zielpunktes und den
     Flugleistungen des Segelflugzeuges, die durch die
     ausgew&auml;hlte Polare definiert sind
     <a href="cumulus-settings-glider.html">(Einstellungen/Flugzeug)</a>.
     Es wird angenommen, dass Sie mit der angezeigten
     optimalen Fahrt f&uuml;r den eingestellten McCready Wert fliegen.
     Sie k&ouml;nnen eine Mindesth&ouml;he f&uuml;r die Ankunft am
     Zielpunkt einstellen
     <a href="cumulus-settings-personal.html">(Einstellungen/Pers&ouml;nliches)</a>.
     <br>
     Wird ein negativer Wert angezeigt, so sind Sie unter dem
     Gleitpfad und k&ouml;nnen das Ziel nicht mit der vorhandenen
     H&ouml;he erreichen. Es kann sinnvoll sein, dann den McCready
     Wert zu reduzieren. Sind Sie &uuml;ber dem Gleitpfad, so ist das
     Ziel erreichbar und Sie k&ouml;nnen m&ouml;glicherweise den
     McCready Wert erh&ouml;hen, um schneller zum Ziel zu gelangen.

     <h4>Gleitzahl-Anzeige</h4><a name="ld"></a>

     Neben dem Gleitpfad
     Indikator gibt es auch noch eine Gleitzahl-Anzeige, die
     zus&auml;tzlich als Pr&uuml;fm&ouml;glichkeit benutzt werden
     kann, ob man sein selektiertes Ziel erreicht.  Vorbedingung zur
     Gleitzahlberechnung ist, dass ein Ziel ausgew&auml;hlt wurde,
     ansonsten wird nichts angezeigt. Die Anzeige besteht aus zwei
     Werten, die durch einen Schr&auml;gstrich voneinander getrennt
     sind. Auf der linken Seite wird die erforderliche Gleitzahl zum
     Ziel angezeigt. Diese berechnet sich aus der momentanen
     H&ouml;he, von der die Gel&auml;ndeh&ouml;he des Zielpunktes und
     die eingestellte Sicherheitsh&ouml;he abgezogen werden und der
     Wegl&auml;nge zum Ziel. Auf der rechten Seite steht die aktuell
     ermittelte Gleitzahl &uuml;ber die letzten 60 Sekunden. Diese ist
     unabh&auml;ngig von Wind und Verschmutzungseinfl&uuml;ssen. Ist
     sie dauerhaft h&ouml;her als die erforderliche Gleitzahl, so
     sollte man sein Ziel sicher erreichen. Falls man keine H&ouml;he
     verliert oder sich im Steigen befindet, so wird als Ergebnis
     <i>&gt;99</i> angezeigt. Stehen keine sinnvollen Anzeigewerte zur
     Verf&uuml;gung, so wird das mittels des Minus Zeichens
     dargestellt.

     <p></p>

    <table width="100%">
    <tr>
    <td align="left"><a href="cumulus-preflight-settings-common.html">zur&uuml;ck</a></td>
    <td align="center"><a href="cumulus.html">Anfang</a></td>
    <td align="right"><a href="cumulus-usage.html">weiter</a></td>
    </tr>
    </table>

</body>
</html>
