<!-- $Id$ -->

<html>
<head>
  <title>Cumulus Einstellungen</title>
  <link rel="stylesheet" type="text/css" href="text.css">
</head>
<body>

    <table width="100%">
    <tr>
    <td></td>
    <td align="center"><a href="cumulus.html">Anfang</a></td>
    <td></td>
    </tr>
    <tr>
    <td align="left"><a href="cumulus-settings-map-settings.html">zur&uuml;ck</a></td>
    <td align="center"><a href="cumulus-settings.html">&Uuml;bersicht</a></td>
    <td align="right"><a href="cumulus-settings-terrain.html">weiter</a></td>
    </tr>
    </table>

<h3 align="center">Einstellungen</h3>

<p><b>Karte - Objekte</b></p>

<p>
Hier k&ouml;nnen Sie die Objekte ausw&auml;hlen, die geladen und auf der Karte angezeigt
werden sollen.</p>

<p>
Wenn Sie zu wenig Arbeitsspeicher haben oder Sie wollen die Menge der angezeigten
Informationen auf der Karte reduzieren, dann sollten Sie die entsprechende Kreuze
bei den angezeigten Ojekten in der Tabelle entfernen. Diese Objekte werden dann auch nicht mehr
geladen. Sie m&uuml;ssen nach &Auml;nderungen einen Neustart von Cumulus durchf&uuml;hren,
damit Ihre neue Auswahl auch aktiv wird.
</p>

<p>
Das Abschalten von einzelnen Objekten steigert die Lade- und Zeichengeschwindigkeit
und nimmt auch weniger Arbeitsspeicher in Anspruch. Besonders betroffen sind davon
die H&ouml;henfl&auml;chen. Ist das Laden und Zeichen dieser aktiviert, wird das Gel&auml;nde
entsprechend den vorgegebenen Terrainfarben eingef&auml;rbt.
<b>Beachten Sie!</b> Um Gel&auml;ndeh&ouml;hen zur Verf&uuml;gung zu haben, m&uuml;ssen die
H&ouml;henfl&auml;chen aktiviert sein.</p>

<p>
Die Kurslinie ist eine Linie von Ihrer gegenw&auml;rtigen Position zu Ihrem
gew&auml;hlten Ziel. Sie kann in unterschiedlichen Farben gezeichnet werden, wenn
ein Flugzeug ausgew&auml;hlt wurde. Die Farben symbolisieren die Erreichbarkeit
Ihres Zieles.</p>

<p>
Beschriftungsmarken neben bestimmten Kartenobjekten k&ouml;nnen hier und auch &uuml;ber
das Men&uuml; ein- bzw. ausgeschaltet werden. Weiterhin gibt es bestimmte Tasten
daf&uuml;r. Siehe <a href="cumulus-usage.html#shortcuts">hier</a> f&uuml;r weitere
Hinweise dazu. Eine Beschriftungsmarke, normaler Weise der Name des Objektes,
wird nebem dem Objekt gezeichnet, wenn die entsprechende Option aktiv ist.
Seinen Sie vorsichtig mit der Aktivierung solcher Marken. Sie k&ouml;nnen bei gr&ouml;&szlig;en
Kartenma&szlig;st&auml;ben sich gegenseitig oder auch andere Kartenobjekte verdecken.
</p>

<p>
Wegpunkte sind mit einem Wertungsattribut versehen. Die folgenden Attribute sind
in Verwendung:
</p>

<ul>
  <li> klein
  <li> normal
  <li> gro&szlig;
</ul>

<a name="WaypointImportance"></a>

<p>
In der Box <i>Zeichne Wegpunkte bis Skala</i> k&ouml;nnen Sie festlegen, bis zu
welcher Skala Wegpunkte entsprechend Ihres zugeordneten Wertungsattribut
auf der Karte gezeichnet werden. Bei Erreichen des vorgegebenen Limits,
werden die Wegpunkte automatisch ausgeblendet.
</p>

    <table width="100%">
    <tr>
    <td></td>
    <td align="center"><a href="cumulus.html">Anfang</a></td>
    <td></td>
    </tr>
    <tr>
    <td align="left"><a href="cumulus-settings-map-settings.html">zur&uuml;ck</a></td>
    <td align="center"><a href="cumulus-settings.html">&Uuml;bersicht</a></td>
    <td align="right"><a href="cumulus-settings-terrain.html">weiter</a></td>
    </tr>
    </table>
</body>
</html>
