<!-- $Id$ -->

<html>
<head>
  <title>Cumulus Einstellungen</title>
  <link rel="stylesheet" type="text/css" href="text.css">
</head>
<body>

    <table width="100%">
    <tr>
    <td></td>
    <td align="center"><a href="cumulus.html">Anfang</a></td>
    <td></td>
    </tr>
    <tr>
    <td align="left"><a href="cumulus-settings-gps.html">zur&uuml;ck</a></td>
    <td align="center"><a href="cumulus-settings.html">&Uuml;bersicht</a></td>
    <td align="right"><a href="cumulus-settings-map-settings.html">weiter</a></td>
    </tr>
    </table>

    <h3 align="center">Einstellungen</h3>

    <h4>Flugzeuge</h4>

    Hier k&ouml;nnen Sie die Daten der von Ihnen benutzten Flugzeuge
    eingeben. Um Eintr&auml;ge hinzuzuf&uuml;gen, zu ver&auml;ndern oder
    zu l&ouml;schen, benutzen Sie bitte die Ikonen rechts oberhalb der Liste:

    <ul>
      <li> Neu = Plus Zeichen
      <li> Bearbeiten = Bleistift
      <li> L&ouml;schen = Papierkorb
     </ul>

    Neben den bereits vorhandenen Flugzeugen mit ihren Polardaten,
    k&ouml;nnen Sie diese auch durch eigene Eintr&auml;ge
    erg&auml;nzen. Beachten Sie, dass die gemachten &Auml;nderungen
    nur wirksam werden, wenn Sie die Men&uuml;s mit dem <i>OK</i>
    Knopf verlassen. Sollten Sie ausversehen einen Flugzeugeintrag aus
    der Liste l&ouml;schen, dr&uuml;cken Sie den Cancel Knopf (das
    kleine X) und alles wird gut.

    <p>
    Habe Sie den Neu- bzw. Bearbeiten Knopf gedr&uuml;ckt, wird ein
    neues Men&uuml; ge&ouml;ffnet. W&auml;hlen Sie hier Ihr Flugzeug aus
    der angebotenen Liste aus oder tragen Sie die Daten Ihres
    Segelflugzeuges hier ein, wenn es in der Liste nicht enthalten
    ist. Die einzugebenden Werte entsprechen drei Punkten auf der
    Flugzeug Polare, die benutzt werden, um die angen&auml;herte
    Polare zu bestimmen. Diese Werte werden in km/h f&uuml;r die Fahrt
    und m/s f&uuml;r das Sinken angegeben. Die Sinkwerte sind negativ!
    Um genaue Ergebnisse zu erhalten, sollte man den ersten Punkt im
    Bereich des besten Gleitens w&auml;hlen, den dritten Punkt im
    Bereich zwischen 170 km/h und VNe, und den zweiten Punkt etwa in
    der Mitte zwischen den beiden anderen Werten.
    </p>

    <p>
    Tragen Sie weiterhin das Leergewicht Ihres Flugzeuges und die
    voraussichtliche Zuladung ein. Wenn Sie mit Wasserballast fliegen,
    geben Sie bitte die korrekte Menge in Litern an. Sie k&ouml;nnen
    die aktuelle Zuladung und auch die im Flug mitgef&uuml;hrte
    Wassermenge ebenfalls im Flugvorbereitungsmen&uuml;
    aktualisieren.
    </p>

    <p>
    Das eingegebene Kennzeichen und das Rufzeichen werden im IGC-Logfile benutzt.
    </p>

    <p> Sie k&ouml;nnen eine graphische Darstellung der Polare
    erhalten, indem Sie auf den Knopf <i>Polare zeigen</i>
    dr&uuml;cken. Hier erhalten Sie auch Informationen &uuml;ber das
    berechnete beste Gleiten und die optimale Fahrt. Benutzen Sie die
    Pfeiltasten <i>auf/ab</i>, <i>rechts/links</i>, um verschiedene
    Wind- und Aufwindwerte zu simulieren. Die entsprechende Tangente
    wird sofort berechnet und die Werte dazu angezeigt. Mit der
    Auswahltaste k&ouml;nnen Sie den Ausgangszustand der Polare
    wiederherstellen.
    </p>

    <p>
    Um eigene Flugzeuge in die Auswahlliste aufzunehmen, bearbeiten
    Sie die Datei <i>glider.pol</i> im Verzeichnis
    <i>/opt/cumulus/etc</i>. Besser ist es aber Ihre Erg&auml;nzungen dem Cumulus
    Team per Email zu schicken, damit es Ihre Daten in diese Datei &uuml;bernehmen
    kann. Jede Neuinstallation von Cumlus stellt den alten Zustand der Datei
    <i>glider.pol</i> wieder her und &uuml;berschreibt Ihre gemachten &Auml;nderungen.
    </p>

    <table width="100%">
    <tr>
    <td></td>
    <td align="center"><a href="cumulus.html">Anfang</a></td>
    <td></td>
    </tr>
    <tr>
    <td align="left"><a href="cumulus-settings-gps.html">zur&uuml;ck</a></td>
    <td align="center"><a href="cumulus-settings.html">&Uuml;bersicht</a></td>
    <td align="right"><a href="cumulus-settings-map-settings.html">weiter</a></td>
    </tr>
    </table>
</body>
</html>
