<html>
<head>
<title>Cumulus Einstellungen</title>
<link rel="stylesheet" type="text/css" href="text.css">
</head>
<body>

	<table width="100%">
		<tr>
			<td></td>
			<td align="center"><a href="cumulus.html">Anfang</a></td>
			<td></td>
		</tr>
		<tr>
			<td align="left"><a href="cumulus-settings-lines.html">zur&uuml;ck</a></td>
			<td align="center"><a href="cumulus-settings.html">&Uuml;bersicht</a></td>
			<td align="right"><a href="cumulus-settings-airspace.html">weiter</a></td>
		</tr>
	</table>

	<h4 align="center">Einstellungen - Punkt Daten</h4>

	<b>Punkt Daten</b>

	<p>
		Cumulus l&auml;dt Punktdaten von folgender Quelle:
		
		<ul>
		  <li><a href="cumulus-maps-openAIP.html">openAIP</a></li>
    </ul>
  </p>
  
	<p>
		Das <a href="http://www.openaip.net">openAIP</a> Projekt stellt pro Land 
		verschiedene Punkt Daten bereit. Der Vorteil von <i>openAIP</i> ist, dass
		jeder daran selber mitarbeiten kann, wenn er sich beim Projekt registriert
		hat. Ein kleiner Nachteil ist, dass Sie erst in Cumulus die L&auml;nder
		definieren m&uuml;ssen, die Sie installieren wollen. Der Rest wird
		dann automatisch durch Cumulus getan, wenn Sie den <i>Download</i> Knopf
		dr&uuml;cken.
	</p>
	
	<p><b>Nutzungsbedingen f&uuml;r externe Daten</b></p>
	
	<p>
	Bitte lesen und akzeptieren Sie die Nutzungsbedingen von
  </p>
  
  <ul>
   <li> <a href="http://www.openaip.net/legal">openAIP</a></li>
  </ul>
  
  bevor Sie diese Daten benutzen.

	<hr>
  
	<dl>
    <dt>
      <b>Quelle</b>
    </dt>

    <dd>
      Die Box Quelle zeigt die Auswahl an, die Cumulus benutzen soll.
      F&uuml;r jede Quelle gibt es eine eigene Form, in deren Kopf der
      Weblink zur Seite der gerade ausw&auml;hlten Quelle zu sehen ist.
    </dd>
   </dl>
    
   <hr>
        
    <dl>
        <a name="openAIP_Download"></a>
    <dt>
      <b>openAIP - Download</b>
    </dt>

    <dd>
			Tragen Sie neben dem <i>Download</i> Knopf die L&auml;nder ein,
			welche Sie vom openAIP Server runter laden m&ouml;chten. Verschiedene
			L&auml;nder k&ouml;nnen hintereinander durch Kommas oder Leerzeichen
			getrennt angegeben werden. Die L&auml;nderkennungen (zwei
			Buchstabenkode) sind nach ISO-3166 kodiert. Wenn Sie den
			<i>Download</i> Knopf dr&uuml;cken, werden die Punkt Dateien
			der gew&uuml;nschten L&auml;nder von openAIP runter geladen und in Cumulus
		  installiert.
		  <br><br>
		  <b>Achtung!</b> Wenn Cumulus in Bewegung ist, sind keine Downloads m&ouml;glich.
			<br><br>
			Aktualisierungen werden von openAIP ohne extra Ank&uuml;digung in
			sehr kurzen Zeitr&auml;umen bereit gestellt. Deswegen ist es
			sinnvoll, ab und zu die Punkt Dateien erneut runter zu laden, um
			aktuell zu bleiben.
			<br><br>
			<b>Achtung!</b> Das macht Cumulus nicht von alleine.
		</dd>
    
    <br><a name="openAIP_Radius"></a>
    <dt>
      <b>openAIP - Radius Filter</b>
    </dt>

    <dd>
			Alle innerhalb des Radius um die Heimatposition liegenden
			Punkt Dateien werden aus den installierten und ausgew&auml;hlten
			openAIP Dateien eingelesen.
			<b>Achtung!</b> Ist Ihre gegenw&auml;rtige Position au&szlig;erhalb
			des vorgegebenen Radius, werden keine Flug- und Landepl&auml;tze
			mehr auf der Karte angezeigt.
		</dd>

    <br>
    <a name="openAip_RunwayLengthFilter"></a>
    <dt>
      <b>openAIP SLB L&auml;ngen Filter</b>
    </dt>
    </a>

    <dd>
      Hier k&ouml;nnen Sie eine Mindestl&auml;nge f&uuml;r die SLB
      des ein zu lesenden Punktes vorgeben,
      um Objekte mit zu kurzen Landebahnen weg zu filtern. Wird die
      L&auml;nge des Filters auf Null gesetzt, ist es nicht aktiv.
    </dd>

    <br>
    <dt>
      <a name="openAIP_Load"><b>openAIP - Laden</b></a>
    </dt>

    <dd>
      Wenn Sie den <i>Laden</i> Knopf dr&uuml;cken, wird eine Tabelle ge&ouml;ffnet
      in der Sie alle ladbaren <i>openAIP</i> Punkt Dateien sehen. Die von
      Cumulus runter geladenen Punkt Dateien haben folgendes Namensformat:
      <br><br>
      &lt;L&auml;nderkenner&gt;_wpt.aip f&uuml;r Flugpl&auml;tze<br>
      &lt;L&auml;nderkenner&gt;_nav.aip f&uuml;r Funk Navigationshilfen<br>
      &lt;L&auml;nderkenner&gt;_hot.aip f&uuml;r Thermikpunkte<br>
      <br>
      Im Kopf der Tabelle sehen Sie das Datenverzeichnis, in dem die
      angezeigten Dateien zu finden sind.
      In jeder Tabellenzeile gibt es links eine Checkbox, die man aktiviert,
      wenn die entsprechende Datei geladen werden soll. Ist die Checkbox
      deaktiviert, erfolgt kein laden. Wenn Sie alle Dateien laden wollen,
      so aktivieren Sie die Checkbox ganz oben links in der ersten
      Tabellenzeile mit dem Titel <i>Alle Ein/Aus schalten</i>. <b>Beachten Sie!</b>
      Wenn Sie eine Einzelauswahl vornehmen m&ouml;chten, muss die
      <i>Alle Ein/Aus schalten</i> Checkbox <b>deaktiviert</b> sein.
      <BR> Wenn Sie das Fenster mit <i>Ok</i>
      verlassen, wird sofort ein Neuladen der Punkt Daten
      angesto&szlig;en, falls Sie etwas ver&auml;ndert haben.
      <br>
      Wenn Sie einzelne Tabellenreihen selektieren, k&ouml;nnen Sie die darin
      angezeigten Dateien l&ouml;schen, wenn sie auf den M&uuml;lleimer Knopf
      dr&uuml;cken.
    </dd>
    </dl>
    
    <hr>

		<dl>
		<dt>
			<b>Listen Anzeige</b>
		</dt>

		<dd>Im Listen Anzeige Bereich k&ouml;nnen Sie die Zeilenh&ouml;he
			einiger Listen so ver&auml;ndern, dass sie besser lesbar werden.
			Gleichzeitig sinkt damit aber die Anzahl der angezeigten
			Eintr&auml;ge pro Listenseite.
		</dd>
	  </dl>

	<p></p>
	<table width="100%">
		<tr>
			<td></td>
			<td align="center"><a href="cumulus.html">Anfang</a></td>
			<td></td>
		</tr>
		<tr>
			<td align="left"><a href="cumulus-settings-lines.html">zur&uuml;ck</a></td>
			<td align="center"><a href="cumulus-settings.html">&Uuml;bersicht</a></td>
			<td align="right"><a href="cumulus-settings-airspace.html">weiter</a></td>
		</tr>
	</table>
  
</body>
</html>
